---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.StairsRuntypeHasMonolithicSupport
source: html/f94719cb-10da-e5b1-0dcc-3636034eddd1.htm
---
# Autodesk.Revit.DB.ParameterTypeId.StairsRuntypeHasMonolithicSupport Property

"Monolithic Support": Monolithic Support

## Syntax (C#)
```csharp
public static ForgeTypeId StairsRuntypeHasMonolithicSupport { get; }
```